"use-strict";

// 1. 알파벳 소문자, 대문자, 숫자 0-9중 하나가 주어졌을 때, 주어진 글자의 아스키 코드값을 출력하는 프로그램을 작성하시오.

// 알파벳 소문자, 대문자, 숫자 0-9중 하나가 주어졌을 때, 주어진 글자의 아스키 코드값을 출력하는 프로그램을 작성하시오.

// const string = "A";
// console.log(string.charCodeAt(0));

// 2. N개의 숫자가 공백 없이 쓰여있다. 이 숫자를 모두 합해서 출력하는 프로그램을 작성하시오.

// let input = ["5", "54321"];
// let sum = 0;

// for (const num of input[1]) {
//   sum += parseInt(num);
// }
// console.log(sum);

// 3. 알파벳 소문자로만 이루어진 단어 S가 주어진다. 각각의 알파벳에 대해서, 단어에 포함되어 있는 경우에는 처음 등장하는 위치를,

// 포함되어 있지 않은 경우에는 -1을 출력하는 프로그램을 작성하시오.
